# 進階的 SQL 五十道練習

## 快速複習基礎的 SQL 查詢敘述

### 0301（程式題）查詢 imdb 資料庫 movies 資料表中第八至第十列的觀測值。

answer_0301 =\
"""

"""

### 0302（程式題）查詢 covid19 資料庫 locations 資料表中第十三列至第十六列的觀測值。

answer_0302 =\
"""

"""

### 0303（程式題）查詢 imdb 資料庫 movies 資料表中於 1994 年上映的電影。

answer_0303 =\
"""

"""

### 0304（程式題）查詢 covid19 資料庫 locations 資料表中台灣的資料。

answer_0304 =\
"""

"""

### 0305（程式題）查詢 covid19 資料庫 calendars 資料表中最小的日期與最大的日期。

answer_0305 =\
"""

"""

### 0306（程式題）查詢 imdb 資料庫 movies 資料表中最短的片長與最長的片長。

answer_0306 =\
"""

"""

### 0307（程式題）查詢 imdb 資料庫 movies 資料表中最短片長與最長片長的電影。

answer_0307 =\
"""

"""

### 0308（程式題）查詢 covid19 資料庫 accumulative_cases 資料表中最小的日期與最大的日期。

answer_0308 =\
"""

"""

### 0309（程式題）查詢 covid19 資料庫台灣的資料。

answer_0309 =\
"""

"""

### 0310（程式題）查詢 imdb 資料庫 Top Gun: Maverick 的演員陣容。

answer_0310 =\
"""

"""